[
  {
    "title": "Elektra Awards 2025 open for entries",
    "source": "Electronics Weekly",
    "date": "Posted on 20th May 2025 | Modified on 21st May 2025",
    "link": "https://www.electronicsweekly.com/news/elektra-awards-news/elektra-awards-2025-open-for-entries-2025-05/",
    "text": "Elektra Awards 2025 open for entries The Elektra Awards 2025, organised by Electronics Weekly , are open for entries from both companies and individuals in the electronics industry. The date of the awards is Tuesday 9 December, taking place at the Hilton Bankside in central London. Elektra Awards 2025 “For more than 20 years, the Elektra Awards have been the bellwether for innovation in the electronics industry,” says Electronics Weekly ‘s editor, Caroline Hayes. “The glamorous awards evening is a celebration of the unique people and companies that drive our fast-paced electronics industry.” “To make it above all an evening of inspiration and aspiration, we are asking you to submit your entry to help us identify the focus for each sector and to highlight the work being done to promote, progress or unify the design community.” Note that the winners are chosen by a select panel of industry professionals, she highlighted. In other words, peers endorsing design expertise or best practises across a wide range of industry sectors. As a result, the Elektra awards serve to acknowledge technological excellence and advances and inspire others to attain new heights of distinction and quality. “I encourage anyone with a stake in advancing the electronics community to submit one or more entries (there is no fee to enter) and show the world how you are advancing excellence in electronics design.” Entries will close Friday 13 June 2025 . You can view the categories for the Elektra Awards 2025 awards and enter here . The criteria for each award is also listed. New for 2025 Note, new for 2025, we have the category Entrepreneurial Star (under 35) . Electronics Weekly is looking for a talented young electronics entrepreneur (under 35 years of age) who has started a business based on electronics engineering. Entrants must have identified a gap in the market and demonstrate how he or she has met this need with innovative products based on electronics design, bold but sound business practices, a flair for raising funds and a drive to grow the company. Also new for 2025 is the Neurodiversity Product Design Award . This award celebrates the achievements of design engineers in developing products specifically to support neurodiverse users. It will recognise empathy to meet particular needs and technical excellence in executing a functioning product that enriches the lives of users, from visual aids to the hearing impaired to personal devices to facilitate tasks for children or adults. Awards categories In full, the categories for entries are: Manufacturer of the Year Best Electronics Workplace Award Start-up of the Year Automotive / Hi-Rel Semiconductor Product of the Year Consumer Semiconductor Product of the Year Medical Semiconductor Product of the Year Power System Product of the Year Smart Building Product of the Year Passive/Interconnection/Electromechanical Product of the Year The Futurist Award Design Tool and Development Software Product of the Year Neurodiversity Product Design Award Educational Support Award Rising Star Award Design Team of the Year Entrepreneurial Star (under 35) EW BrightSparks Readers’ Choice Award: University Research Group of the Year ( no e ntries for this award ) If you have any awards enquiries, please email . See also : Elektra Awards 2024 – The Winners Elektra Awards 2025 looking for tech stars – companies, entrepreneurs and designers Elektra Awards 2025 2025-05-20 Alun Williams tweet"
  },
  {
    "title": "NMI hosts industry conference in Glasgow with theme of growth",
    "source": "Electronics Weekly",
    "date": "Posted on 18th March 2025 | Modified on 18th March 2025",
    "link": "https://www.electronicsweekly.com/news/nmi-hosts-industry-conference-in-glasgow-2025-03/",
    "text": "NMI hosts industry conference in Glasgow with theme of growth NMI is bringing together industry stakeholders at its conference in Glasgow on March 26th, with a theme to explore the new markets and technologies to drive expansion. The industry association – for semiconductor, microelectronics, and digital technology companies – will be hosting the event at the University of Strathclyde. The venue is the university’s Technology and Innovation Centre. For context, the trade body is highlighting the expected growth of the global semiconductor industry. It is projected to become a $2 trillion per year market within the next decade Topics that will be on the agenda at include manufacturing innovation, semiconductor market trends sustainability, and the impact of emerging technologies. Speakers Key speakers include Giulietta Poltronieri, Partner at McKinsey, who will discuss opportunities in emerging semiconductors. And Andrew Witney from Vishay, on opportunities in emerging semiconductors and the role of wide-bandgap semiconductors in the NetZero transition. Also, Bruno Jansen, GM UK at IMEC, will share insights from a global leader in semiconductor research. And Simon Thomas, CEO of Paragraf, will outline how the UK can carve out leadership positions in the sector by 2035. Note that there will also be a welcome reception will be held the night before the conference, on March 25th. The venue is the prestigious Glasgow City Chambers and the city provost will open the reception. It will feature an addresses from Empire State Invest and the Bulgarian Delegation, providing international perspectives on the evolving semiconductor landscape. Pivotal “The UK’s semiconductor industry is at a pivotal moment,” said Adam Wood, NMI Network Manager. “This event is an opportunity for companies, researchers, and investors to come together and help discuss and drive innovation that will define the sector’s future. By facilitating collaboration and knowledge exchange, we aim to ensure the UK remains a leader in semiconductor technology.” NMI You can read more, and register, on the industry association ‘s website. NMI is part of TechWorks, the UK industry association for promoting “deep tech innovation” across semiconductors, IoT, AI, and digital industries. It aims to serve as a bridge between industry, government, and academia to support UK growth. Image: NMI See also : Silicon Catalyst UK and NMI hook up European SPACE4Cities names 20 winning urban planning projects RUSI report highlights UK ‘defence dividend’ for local areas Elektra Awards 2025 looking for tech stars – companies, entrepreneurs and designers Video: Silicon Motion showcases AI and Industrial innovations NMI 2025-03-18 Alun Williams tweet"
  },
  {
    "title": "DigiKey introduces own-brand DigiKey Standard product line",
    "source": "Electronics Weekly",
    "date": "Posted on 7th May 2025 | Modified on 7th May 2025",
    "link": "https://www.electronicsweekly.com/news/business/distribution/digikey-introduces-own-brand-digikey-standard-product-line-2025-05/",
    "text": "DigiKey introduces own-brand DigiKey Standard product line DigiKey is introducing its own private-labeled product line, DigiKey Standard. The first DigiKey Standard product appeared in 2022 but it is now being expanded into a full product line, spanning kits and soldering stations to power systems and battery holders. The products will deliver “dependable solutions and tools for everyday designing and building needs” says the distributor. “With DigiKey Standard, we’ve thoughtfully built a product portfolio that supports the everyday efforts and innovation of engineers, designers and makers,” said Missy Hall, vice president of new market development at DigiKey. “This launch reflects our long-standing commitment to provide the electrical engineering industry with the top components and tools from a brand they know and trust.” For example, there will be solderless breadboards, ergonomic wire strippers and PCB rulers. You can find the full range on the DigiKey website . Other distributors also offer own-brand product lines. For example, RS Components has RS Pro and Farnell has Multicomp Pro. See also : DigiKey premieres Sustainable Futures video series DigiKey offers Zephyr RTOS workshop, video training DigiKey premieres Sustainable Futures video series Untangling tariffs DigiKey, SparkFun partner for STEM with XRP Robotics Kits Digikey 2025-05-07 Alun Williams tweet"
  },
  {
    "title": "CHIIPS podcast interview with industry veteran Ash Madni",
    "source": "Electronics Weekly",
    "date": "Posted on 28th April 2025 | Modified on 28th April 2025",
    "link": "https://www.electronicsweekly.com/blogs/electro-ramblings/site-update/chiips-podcast-interview-with-industry-veteran-ash-madni-2025-04/",
    "text": "CHIIPS podcast interview with industry veteran Ash Madni The latest episode of the Electronics Weekly podcast, CHIIPS, is out. Check out the latest interview with industry veteran Ash Madni. In his talk with our editor Caroline Hayes, the former RF engineer and current management consultant provides a range of industry insights. Listen to the podcast » Ash Madni also shares his advice for electronics designers and managers to ensure a diverse and productive workplace. Remember, the previous episode of our CHIIPS podcast interviews Helen Duncan , the CEO of Blueshift Memory. CHIIPS CHIIPS? That’s Caroline Hayes’ Industry Insights Podcasts, which is brought to you by Electronics Weekly of course! In the series, she will be chatting to a range of industry figures, covering the topics that matter in the world of electronics. For example, getting an update on particular technology sectors and guests’ insights into what lies ahead for the industry… And don’t forget to bookmark the Electronics Weekly podcast URL: electronicsweeklychiips.podbean.com Ash Madni Note that Ash Madni has an interesting hinterland beyond electronics and engineering, He is also active as a published classical composer, for example. And he has started his first Sci-Fi horror novel Transmutation – ‘The Rise of Hemonra’ . See also : Viewpoint: Andy Sellars interview – Batman, James Bond and Beyond CHIIPS podcast features insights from Katalytik’s Jan Peters Maggie Philbin – CHIIPS podcast interview with TeenTech founder Analog podcast 2025-04-28 Alun Williams tweet"
  },
  {
    "title": "Get Mannerisms, Gadget Master, the Daily and the Weekly, in newsletter form",
    "source": "Electronics Weekly",
    "date": "Posted on 5th June 2025 | Modified on 5th June 2025",
    "link": "https://www.electronicsweekly.com/blogs/electro-ramblings/site-update/get-mannerisms-gadget-master-daily-weekly-newsletter-form-2025-06/",
    "text": "Get Mannerisms, Gadget Master, the Daily and the Weekly, in newsletter form Are you too busy to keep checking our blogs and news section? Let the content come straight to you! Easily digestible newsletter emails straight to your inbox. We have a range of editorial newsletters you can sign up for: Mannerisms , Gadget Master , the Daily and the main Weekly newsletter. Sign up for your choice » Mannerisms (Tuesday, 11am): a roundup of the weeks latest and most popular posts from David Manners’ Mannerisms blog on the semiconductor industry (and more). Gadget Master (Friday, 11am): a pick of the latest posts from the Gadget Master blog, concentrating on both maker projects and the latest gizmos. There’s also a pick of Classic posts from the past. Weekly (Thursday, 11am): rounding up the major news from the week and all developments on the Electronics Weekly site. It also samples the News, Products and Blogs sections. Each week we lead on a different topic. Daily (Monday – Friday, 12:30pm): the latest headlines from the News, Products and Blogs sections. Keeping you on top of things, in one short email. All the newsletter options are mobile optimised. Sign up for your choice » Don’t forget to also sign up for Industry Updates , bringing you the latest technology and product news direct from industry companies. Note that these emails are sponsored content, sourced from the companies directly. CHIIPS Podcast Episode 2 – Insights from ANDtr’s Valerie Lynch and Nicola Thorn Electronics Weekly launches CHIIPS podcast for electronics insights Welcome to the new look Electronics Weekly Get the Electronics Weekly magazine Digital Edition Electronics Weekly 2025-06-05 Alun Williams tweet"
  },
  {
    "title": "Elektra Awards 2025 looking for tech stars – companies, entrepreneurs and designers",
    "source": "Electronics Weekly",
    "date": "Posted on 3rd June 2025 | Modified on 3rd June 2025",
    "link": "https://www.electronicsweekly.com/news/elektra-awards-2025-looking-for-tech-stars-companies-entrepreneurs-and-designers-2025-06/",
    "text": "Elektra Awards 2025 looking for tech stars – companies, entrepreneurs and designers Electronics Weekly has begun its search for the shining stars and leading lights of the international electronics industry. As well as categories to showcase design excellence, did you know we have some new categories this year, designed to bring out the best personal qualities and corporate ethos that make people proud. Some of this year’s categories are designed to bring out individual strengths: Entrepreneurial Star – Are you a young (under 35 years) entrepreneur of the electronics industry? We want to hear how your drive and ambition have formed your career journey; how you identified a market need, started your company and/or charted its growth. Others are for companies with award categories that encourage businesses to flourish: Start-up of the Year – Young companies have high-energy and high impact in our industry. This award is for bright and creative electronics hardware or product design that challenges established markets and practices. Best Workplace Award – Companies that value talent attract talent. We want to hear about the initiatives and incentives that make your company desirable, happy, productive and caring. Others are to demonstrate how the electronics industry can improve lives: Neurodiversity Product Award – If you have been part of a project that shows empathy by designing an audio, visual or sensory aid for use by neurodiverse individuals – tell us about your design. The Futurist Award – Does a prototype you have been involved with break barriers to advance the technology of the future – like last year’s winner GroundWaves and its sensory footwear – haptic sneakers. Other categories are for Smart Building Product (how the IoT can protect and serve), Educational Support, Design Teams and Design Tools (including test instruments), Passive/Interconnection/Electromechanical Product, Power System, Medical, Automotive, Consumer, Automotive and Manufacturer of the Year. It is free to enter before Friday 13 June. Show us what you’ve got! Elektra Awards 2024 – The Winners Elektra Awards 2025 open for entries Start-ups: The Cambridge effect Williams fund makes first investment in IoT gas monitoring firm Tech start-ups pick up awards from Deloitte Elektra Awards 2025 Start-up 2025-06-03 Caroline Hayes tweet"
  },
  {
    "title": "IPC praises President Trump for defence industry support",
    "source": "Electronics Weekly",
    "date": "Posted on 28th March 2025 | Modified on 28th March 2025",
    "link": "https://www.electronicsweekly.com/news/ipc-praises-war-hating-president-trump-for-defence-industry-support-2025-03/",
    "text": "IPC praises President Trump for defence industry support The IPC, the industry association for printed circuits and electronics assembly chose the anniversary of President Biden issuing the Presidential Determination 2023-06, to lament the lack of investment in the US PCB industry. The Presidential order, signed in March 2023, invoked the Defense Production Act (DPA), which was designed to stimulate US investment in PCB manufacture and ‘related technologies’. According to the IPC , the directive “identified a critical technology shortfall that, if left unaddressed, would ‘severely impair national defense’ and undermine the American warfighter”. In 2017, President Trump, who describes himself as an ‘anti-war president’ signed an executive order to asses the US defence industrial base. The following Biden directive reported that the domestic PCB industrial base was “ageing, shrinking, and failing to maintain the state of the art,” and that “some advanced high-density interconnect products [are] simply not producible in the US.” According to the IPC “Little has changed in the two years . . . The US continues to marginalize investments in the PCB industry that are essential to US military superiority and mission-critical functions carried out by warfighters.” The association said it “welcomes President Trump’s commitment to strengthen the US electronics industrial base through new policy initiatives and sustained, strategic investment.” It added that the association is committed to working with the administration and policymakers on Capitol Hill to ensure that America’s defence electronics capabilities are secure, resilient, and world-class. IPC sets the industry on the path to sustainability Why engineers are seeking more sustainable PCB designs Collaboration is key for hardware manufacturing Siemens acquires Supplyframe for a ‘digital transformation’ IPC PCB PCB design 2025-03-28 Caroline Hayes tweet"
  },
  {
    "title": "IPC sets the industry on the path to sustainability",
    "source": "Electronics Weekly",
    "date": "Posted on 27th March 2025 | Modified on 27th March 2025",
    "link": "https://www.electronicsweekly.com/news/ipc-sets-the-industry-on-the-path-to-sustainability-2025-03/",
    "text": "IPC sets the industry on the path to sustainability The IPC, the trade association for electronics assembly companies, has released the findings of recent research into the industry’s approach to sustainability. Each year, electronic waste accounts for $57 billion in losses including the disposal of iron, copper, and gold.  The survey finds that sustainability is inspiring changes to every aspect of electronics manufacturing, said Dr John W Mitchell, the IPC ’s president and CEO. “Collective action garners greater results. Sustainability efforts can’t achieve their maximum impact if they exist in silos. The survey findings show the electronics industry needs alignment, knowledge-sharing, and a collective push to accelerate impact,” he said. The survey found that more than half (59%) of respondents expect their companies to increase sustainability efforts in 2025. PCB and contract manufacturers anticipate the greatest growth. Two thirds of companies are motivated by the need for regulatory compliance but also by efficiency gains (58%), technological advancements (56%), and long-term competitive positioning (55%), the survey found. The main challenges to implementation of sustainability measures are budget constraints, regulatory complexity, uncertainty around regulations and compliance with those regulations and limited expertise. Most respondents reported having a formal sustainability strategy in place, with EMS and OEM companies most likely to have dedicated sustainability teams and formal sustainability strategies compared with other sub-industries. Only 3% of respondents indicated that their companies did not have a formal sustainability strategy in operation. More than half (59%) expected efforts to increase this year led by PCB and contract manufacturers, followed by OEMs. Over a third (38%) did not expect any change and 3% indicated a decrease in a focus on sustainability. Following the January 2025 survey, IPC has launched Evolve , a programme for industry-wide knowledge about best practices, and to provide access to resources to navigate challenges. IPC praises President Trump for defence industry support Würth Elektronik and One Tree Planted branch out for reforestation in Americas circuit IPC Sustainability 2025-03-27 Caroline Hayes tweet"
  },
  {
    "title": "Imec launches Stuttgart advanced chip design accelerator",
    "source": "Electronics Weekly",
    "date": "Posted on 31st March 2025 | Modified on 1st April 2025",
    "link": "https://www.electronicsweekly.com/news/design/861118-2025-03/",
    "text": "Imec launches Stuttgart advanced chip design accelerator Belgian research lab Imec has launched a chip design accelerator with the State Government of Baden-Württemberg. ACDA (Advanced Chip Design Accelerator) will be based at the Innovation Park Artificial Intelligence, in Heilbronn, north of Stuttgart. Part of Imec’s automotive chiplet program, it will develop chiplets, packaging, sensing and edge AI technology. “By adding this complementary expertise to Imec’s existing automotive R&D offering, the competence center will be able to better support the local and international automotive industry in de-risking and accelerating the introduction of automotive chiplets into manufacturing,” according to Imec. €40m has been provided by the Baden-Württemberg ministry of economic affairs, labour and tourism, initially for five years, and the State of Baden-Württemberg is adding €5m for an office and scientific support from Fraunhofer-Gesellschaft. “We are excited to bring our expertise and global partner network to the state of Baden-Württemberg, the cradle of the automotive industry in Germany,” said Imec president and CEO Luc Van den hove ( photo left ). “We also look forward to expanding our collaboration with Fraunhofer to leverage on our expertise and lay the foundation for future chiplet solutions. To realise the region’s ambitions, we will also focus on growing the talent pipeline across Europe by training engineers in collaboration with the local ecosystem, including universities.” “High-performance chips are playing an important role for software-driven applications in core industries in Baden-Württemberg and are increasingly shaping mobility, artificial intelligence and digitalisation,” said Baden-Württemberg minister of economic affairs Nicole Hoffmeister-Kraut ( photo right ). Baden-Württemberg and Flanders signed a memorandum of understanding on electronics cooperation last year. CMOS 2.0 Europe to get 10nm and 7nm FD-SOI pilot line Imec reveals CO2 assessment tool for fabs VLSI Symposium: Imec’s low-power UWB transceiver ranges to 1.4mm IMEC 2025-03-31 Steve Bush tweet"
  },
  {
    "title": "Auto hi-voltage detector claims fastest response time",
    "source": "Electronics Weekly",
    "date": "Posted on 16th May 2025 | Modified on 16th May 2025",
    "link": "https://www.electronicsweekly.com/news/products/power-supplies/auto-hi-voltage-detector-claims-fastest-response-time-2025-05/",
    "text": "Auto hi-voltage detector claims fastest response time ABLIC claims that its S-19116 Series automotive high-voltage detector has the industry’s fastest detection response time of max. 6.8μs while achieving ultra-low current consumption of 2.0μA typ The detector is also claimed to significantly reduce system standby current. It comes in an  HSNT-6 (1.96×2.46×t0.5mm) package. Overvoltage protection is essential when supplying voltage from a battery through a regulator to MCUs and sensors. The countermeasure involves detecting irregularities such as overvoltage in the regulator output using a voltage detector, and safely resetting the MCU. However, during this process, the voltage supplied from the regulator to the MCU and sensors continues to rise, potentially exceeding the ECU’s voltage tolerance and creating a risk to system safety and functional safety compliance. This has been a significant technical trade-off in addressing this challenge. While increasing the detection response speed of the voltage monitoring function can mitigate the safety risk, faster detection response typically increases current consumption, which in turn increases the system’s standby current – a critical concern for engineers working to minimize power consumption. The S-19116 Series significantly enhances functional safety for automotive applications by delivering improvements in both detection speed and current consumption performance. Features 1. Fast voltage detection response speed and low current consumption Achieves both the industry’s fastest  detection response time, a 92% reduction compared to industry’s conventional products, and low current consumption of 2.0μA. Increasing the overvoltage detection response speed makes it so that monitoring of voltage increases occurs quicker, ensuring faster output of detection signals to the microcontroller and thereby improving system safety. The low current consumption of 2.0μA during operation also contributes to lower standby current for the overall system. 2. The ultra-small package contributes to a smaller footprint Use of the HSNT-6 (1.96 mm×2.46 mm×t0.5 mm) ultra-small automotive package allows for an approximately 20% smaller footprint than conventional products. 3. The SENSE pin to which monitoring voltage is input allows for a wide range of input voltages from -30 V to 45 V Negative voltage can be applied to the SENSE pin. Because the SENSE pin can be connected upstream of the reverse current protection diode installed each ECU, the product can also be used for applications requiring high-accuracy, direct monitoring of I/G and battery voltage. 4. Automotive application quality The product undergoes three-temperature tests (low temperature, normal temperature, and high temperature). It is also planned to be made compliant with the AEC-Q100 reliability and quality assessment tests by the AEC (Automotive Electronics Council). PPAP (Production Part Approval Process) compliance is also planned. The product can be used in the severe environments of automobile applications. Specifications ・Operation voltage range: 3.0 V to 36.0 ・Voltage detection range: 8.0 V to 24.0 V ・Detection voltage accuracy: ±1.5% (Ta＝-40℃ to +125℃) ・Hysteresis width: Selectable from 0%, 2.3%, 5%, 9% ・Current consumption during operation: 2.0µA typ. ・Detection response time: 6.8µs max. ・Release delay time: 10ms typ. (C D =3.3 nF) ・Operating temperature: -40 to +125℃ ・Packages: SOT-23-5, HSNT-6(2025) ・AEC-Q100 compliant ・PPAP support available Application Examples ・Automotive applications (engines, transmissions, suspensions, ABS, EV/HEV/PHEV, etc.) ・Automotive battery voltage detection Key Applications ・DC/DC Converter ・On Board Charger (OBC) ・ADAS Domain Controller ・Battery Management System (BMS) ・Inverter Product details https://www.ablic.com/en/semicon/products/automotive/automotive-voltage-detector-reset-ic/s-19116xxxa/ Tiny inductor-inclusive nano-power dc-dc IC Allegro adds Cortex-M4 to 90V motor driver ICs 1.2kV 260A three-phase silicon carbide power module Wide-range ac-dc converter works over 18-264Vac, or 18-375Vdc 2025-05-16 David Manners tweet"
  }
]